Revit 2024 API
StructuralSectionRectangular.Height Property
 Section height, depth.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public double Height { get; set; }
Visual Basic
Public Property Height As Double
	Get
	Set
Visual C++
public:
property double Height {
	double get ();
	void set (double value);
}
See Also
StructuralSectionRectangular Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace